<a href="https://colab.research.google.com/github/adigenova/uohdb/blob/main/code/PYME_database.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# PYME relacional a SQL

In [1]:
# cargamos sqlite3
# https://www.sqlite.org/docs.html
%load_ext sql
#nos conectamos o creamos una base de datos
%sql sqlite:///pyme2.db

## Tabla Cliente
Ejemplos de restricciones en tablas.

In [2]:
%%sql 
CREATE TABLE Cliente (
id_cliente INTEGER PRIMARY KEY,
saldo INTEGER NOT NULL,
descuento INTEGER NOT NULL,
credito INTEGER,
direccion TEXT NOT NULL
);

 * sqlite:///pyme2.db
Done.

[]

In [4]:
#mostramos las tablas de pyme 
# AND name NOT LIKE 'sqlite_%';
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///pyme2.db
Done.

[('Cliente',)]

In [5]:
%%sql 
PRAGMA table_info([Cliente]);

 * sqlite:///pyme2.db
Done.

[(0, 'id_cliente', 'INTEGER', 0, None, 1),
 (1, 'saldo', 'INTEGER', 1, None, 0),
 (2, 'descuento', 'INTEGER', 1, None, 0),
 (3, 'credito', 'INTEGER', 0, None, 0),
 (4, 'direccion', 'TEXT', 1, None, 0)]

In [6]:
#insertamos valores en la db
%%sql 
INSERT INTO Cliente VALUES(1,100,5,0,"Eusebio Lillo 1540");

 * sqlite:///pyme2.db
1 rows affected.

[]

In [8]:
#listamos los valores de la base de datos
%%sql
select * from Fabrica;

 * sqlite:///pyme2.db
(sqlite3.OperationalError) no such table: Fabrica
[SQL: select * from Fabrica;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [12]:
#insertamos un nuevo valor
%%sql 
INSERT INTO Cliente VALUES (3,"",5,0,"Eusebio Lillo 1540");

 * sqlite:///pyme2.db
(sqlite3.IntegrityError) UNIQUE constraint failed: Cliente.id_cliente
[SQL: INSERT INTO Cliente VALUES (3,"",5,0,"Eusebio Lillo 1540");]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [16]:
%%sql
select * from Cliente;

 * sqlite:///pyme2.db
Done.

[(1, 100, 5, 0, 'Eusebio Lillo 1540'),
 (3, '', 5, 0, 'Eusebio Lillo 1540'),
 (5, 10000, 1, None, 'Eusebio Lillo 1540')]

In [15]:
%%sql
INSERT INTO Cliente VALUES (5,10000,1,NULL,"Eusebio Lillo 1540");

 * sqlite:///pyme2.db
1 rows affected.

[]

In [17]:
#unique example
%%sql
drop table if exists Cliente;
CREATE TABLE Cliente (
id_cliente INTEGER PRIMARY KEY,
saldo INTEGER NOT NULL,
descuento INTEGER NOT NULL,
credito INTEGER,
direccion TEXT NOT NULL UNIQUE
);
PRAGMA table_info([Cliente]);
INSERT INTO Cliente VALUES (3,10000,3,NULL,"Eusebio Lillo 1540");

 * sqlite:///pyme2.db
Done.
Done.
Done.
1 rows affected.

[]

In [18]:
%%sql
select * from Cliente;

 * sqlite:///pyme2.db
Done.

[(3, 10000, 3, None, 'Eusebio Lillo 1540')]

In [19]:
%%sql
INSERT INTO Cliente VALUES (1,10000,3,10,"Eusebio Lillo 1540");

 * sqlite:///pyme2.db
(sqlite3.IntegrityError) UNIQUE constraint failed: Cliente.direccion
[SQL: INSERT INTO Cliente VALUES (1,10000,3,10,"Eusebio Lillo 1540");]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [20]:
%%sql
INSERT INTO Cliente VALUES (1,10000,3,10,"Eusebio Lillo 1541");

 * sqlite:///pyme2.db
1 rows affected.

[]

In [21]:
%%sql
select * from Cliente;

 * sqlite:///pyme2.db
Done.

[(1, 10000, 3, 10, 'Eusebio Lillo 1541'),
 (3, 10000, 3, None, 'Eusebio Lillo 1540')]

In [26]:
#check example
# Comentarios en SQL --
%%sql
drop table if exists Cliente;
CREATE TABLE Cliente (
id_cliente INTEGER PRIMARY KEY,
saldo INTEGER NOT NULL,
descuento INTEGER NOT NULL CHECK(descuento >=0 AND descuento <= 100),
credito INTEGER,
direccion TEXT NOT NULL
);
PRAGMA table_info([Cliente]);
INSERT INTO Cliente VALUES (3,10000,3,NULL,"Eusebio Lillo 1540");

 * sqlite:///pyme2.db
Done.
Done.
Done.
1 rows affected.

[]

In [27]:
%%sql
select saldo, descuento, credito from Cliente;

 * sqlite:///pyme2.db
Done.

[(10000, 3, None)]

In [28]:
%%sql
INSERT INTO Cliente VALUES (5,10000,120,NULL,"Eusebio Lillo 1540");
select * from Cliente;

 * sqlite:///pyme2.db
(sqlite3.IntegrityError) CHECK constraint failed: Cliente
[SQL: INSERT INTO Cliente VALUES (5,10000,120,NULL,"Eusebio Lillo 1540");]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [29]:
#check example II
%%sql
drop table if exists Cliente;
CREATE TABLE Cliente (
id_cliente INTEGER PRIMARY KEY,
saldo INTEGER NOT NULL,
descuento INTEGER NOT NULL CHECK(descuento >=0 AND descuento <= 100),
credito INTEGER,
direccion TEXT NOT NULL CHECK(length(direccion) > 5)
);
-- PRAGMA table_info([Cliente]);
INSERT INTO Cliente VALUES (3,10000,3,NULL,"Eusebio lillo 1570");

 * sqlite:///pyme2.db
Done.
Done.
Done.

[]

In [31]:
%%sql
select * from Cliente;

 * sqlite:///pyme2.db
Done.

[(3, 10000, 3, None, 'Eusebio lillo 1570')]

In [32]:
%%sql
INSERT INTO Cliente VALUES (4,10000,3,NULL,"santa elena 2020. rancagua"); --
-- select * from Cliente; --
INSERT INTO Cliente VALUES (7,100,3,NULL,"Sant");

 * sqlite:///pyme2.db
1 rows affected.
(sqlite3.IntegrityError) CHECK constraint failed: Cliente
[SQL: INSERT INTO Cliente VALUES (7,100,3,NULL,"Sant");]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [33]:
%%sql
select * from Cliente;

 * sqlite:///pyme2.db
Done.

[(3, 10000, 3, None, 'Eusebio lillo 1570'),
 (4, 10000, 3, None, 'santa elena 2020. rancagua')]

## Claves foráneas
Ejemplo de restricciones de claves foráneas

In [34]:
%%sql
drop table if exists Pedido;
drop table if exists Cliente;
CREATE TABLE Cliente (
id_cliente INTEGER PRIMARY KEY,
saldo INTEGER NOT NULL,
descuento INTEGER NOT NULL,
credito INTEGER,
direccion TEXT NOT NULL
);
CREATE TABLE Pedido (
  id_pedido INTEGER PRIMARY KEY,
  direccion TEXT NOT NULL,
  fecha TEXT NOT NULL,
  id_cliente INTEGER,
  FOREIGN KEY(id_cliente) REFERENCES Cliente(id_cliente) ON DELETE CASCADE
);

 * sqlite:///pyme2.db
Done.
Done.
Done.
Done.
Done.
Done.

[(0, 'id_pedido', 'INTEGER', 0, None, 1),
 (1, 'direccion', 'TEXT', 1, None, 0),
 (2, 'fecha', 'TEXT', 1, None, 0),
 (3, 'id_cliente', 'INTEGER', 0, None, 0)]

In [35]:
%%sql
PRAGMA table_info([Pedido]);

 * sqlite:///pyme2.db
Done.

[(0, 'id_pedido', 'INTEGER', 0, None, 1),
 (1, 'direccion', 'TEXT', 1, None, 0),
 (2, 'fecha', 'TEXT', 1, None, 0),
 (3, 'id_cliente', 'INTEGER', 0, None, 0)]

In [36]:
%%sql
INSERT INTO Cliente VALUES (3,10000,3,NULL,"Eusebio Lillo 1540");
INSERT INTO Cliente VALUES (1,10000,3,NULL,"Eusebio Lillo 2020");
INSERT INTO Pedido VALUES (1,"Blanco Encalada 1540","28/04/2022",5);

 * sqlite:///pyme2.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [43]:
%%sql
select * from Pedido;

 * sqlite:///pyme2.db
Done.

[(1, 'Blanco Encalada 1540', '28/04/2022', 5)]

In [ ]:
%%sql
INSERT INTO Pedido VALUES (2,"Blanco Encalada 1540","28/04/2022",1);

In [ ]:
%%sql
delete from Cliente where id_cliente == 3;

In [ ]:
%%sql
select * from Cliente;
select * from Pedido;

In [ ]:
#set default example
%%sql
drop table if exists Pedido;
drop table if exists Cliente;
CREATE TABLE Cliente (
id_cliente INTEGER PRIMARY KEY,
saldo INTEGER NOT NULL,
descuento INTEGER NOT NULL,
credito INTEGER,
direccion TEXT NOT NULL
);
CREATE TABLE Pedido (
  id_pedido INTEGER PRIMARY KEY,
  direccion TEXT NOT NULL,
  fecha TEXT NOT NULL,
  id_cliente INTEGER DEFAULT -1,
  FOREIGN KEY(id_cliente) REFERENCES Cliente(id_cliente) ON DELETE SET DEFAULT
);

In [ ]:
%%sql
INSERT INTO Cliente VALUES (3,10000,3,NULL,"Eusebio Lillo 1540");
INSERT INTO Cliente VALUES (1,10000,3,NULL,"Eusebio Lillo 2020");
INSERT INTO Pedido VALUES (1,"Blanco Encalada 1540","28/04/2022",3);
INSERT INTO Pedido VALUES (2,"Blanco Encalada 1540","28/04/2022",1);

In [ ]:
%%sql
delete from Cliente where id_cliente == 3;

In [ ]:
%%sql
select * from Pedido;

In [ ]:
%%sql
INSERT INTO Cliente VALUES (-1,0,0,NULL,"Cliente desconocido");

In [ ]:
%%sql
delete from Cliente where id_cliente == 1;

In [ ]:
%%sql
select * from Cliente;

In [ ]:
%%sql 
select * from Pedido;

In [ ]:
#activate foreing key support on SQL lite
%%sql
PRAGMA foreign_keys;
PRAGMA foreign_keys = ON;
PRAGMA foreign_keys;

In [ ]:
%%sql
delete from Cliente where id_cliente == 3;
select * from Pedido;

## PYME SQL completo
Instrucciones SQL para construir el modelo PYME completo

### Definición de tablas

In [ ]:
#SQL para todas las tablas
%%sql
/* borrramos las relaciones
en el caso que existan previamente */
drop table if exists Detalla;
drop table if exists Manufacturados;
drop table if exists Articulo;
drop table if exists Fabrica;
drop table if exists Pedido;
drop table if exists Cliente;

-- creamos las relaciones --

-- Relación cliente --
CREATE TABLE Cliente (
id_cliente INTEGER PRIMARY KEY,
saldo INTEGER NOT NULL,
descuento INTEGER NOT NULL,
credito INTEGER,
direccion TEXT NOT NULL
);

-- Relación fabrica --
CREATE TABLE fabrica (
id_fabrica INTEGER PRIMARY KEY,
stock INTEGER NOT NULL,
telefono INTEGER NOT NULL
);

-- Relación Pedido --
CREATE TABLE Pedido (
  id_pedido INTEGER PRIMARY KEY,
  direccion TEXT NOT NULL,
  fecha TEXT NOT NULL,
  id_cliente INTEGER,
  FOREIGN KEY(id_cliente) REFERENCES Cliente(id_cliente) ON DELETE CASCADE
);

-- Relación Articulo --
CREATE TABLE Articulo (
  id_articulo INTEGER PRIMARY KEY,
  descripcion TEXT NOT NULL
);

-- Relación Manufacturados --
CREATE TABLE Manufacturados (
  id_articulo INTEGER,
  id_fabrica  INTEGER,
  FOREIGN KEY(id_articulo) REFERENCES Articulo(id_articulo) ON DELETE CASCADE,
  FOREIGN KEY(id_fabrica) REFERENCES Fabrica(id_fabrica) ON DELETE CASCADE,
  PRIMARY KEY (id_articulo,id_fabrica)
);

 -- Relación Detalla --
CREATE TABLE Detalla (
  id_articulo INTEGER NOT NULL,
  id_pedido INTEGER NOT NULL,
  cantidad INTEGER NOT NULL,
  FOREIGN KEY(id_articulo) REFERENCES Articulo(id_articulo) ON DELETE CASCADE,
  FOREIGN KEY(id_pedido) REFERENCES Pedido(id_pedido) ON DELETE CASCADE,
  PRIMARY KEY (id_articulo, id_pedido)
);

### Insertando valores

In [ ]:
%%sql
-- valores en cliente --
INSERT INTO Cliente VALUES(1,100,5,1000,"Eusebio Lillo 1540, Rancagua");
INSERT INTO Cliente VALUES(2,150,1,0,"Blanco Encalada 1540, Santiago");
INSERT INTO Cliente VALUES(3,200,5,500,"Santa ema 1544, Peor es Nada");
INSERT INTO Cliente VALUES(4,250,10,0,"Blanco 666, Santiago");
INSERT INTO Cliente VALUES(5,100,5,0,"Colón 343, Santiago");
INSERT INTO Cliente VALUES(6,300,15,0,"Republica 1454, La Serena");
INSERT INTO Cliente VALUES(7,400,5,2000,"Santo Domingo 1313, Rancagua");

-- valores en fabrica --
INSERT INTO Fabrica(id_fabrica,stock,telefono) VALUES
(1,400,77662323),
(2,10,45456263),
(3,20,30495590),
(4,300,90997676);

-- so on --

In [ ]:
%%sql
select * from Fabrica;